Revit 2024 API
ProjectBrowserDataChangedEventArgs Class
 The event arguments used by the ProjectBrowserDataChanged event.
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2024
Syntax
C#
public class ProjectBrowserDataChangedEventArgs : RevitAPISingleEventArgs
Visual Basic
Public Class ProjectBrowserDataChangedEventArgs _
	Inherits RevitAPISingleEventArgs
Visual C++
public ref class ProjectBrowserDataChangedEventArgs : public RevitAPISingleEventArgs
Inheritance Hierarchy
System.Object
 System.EventArgs
 Autodesk.Revit.DB.Events.RevitAPIEventArgs
 Autodesk.Revit.DB.Events.RevitAPISingleEventArgs
 Autodesk.Revit.DB.Events.ProjectBrowserDataChangedEventArgs
See Also
ProjectBrowserDataChangedEventArgs Members
Autodesk.Revit.DB.Events Namespace